# Алгоритмы сортировки - начало

def SelectionSortStep(array, i):
    '''
    Функция одного шага сортировки выбором.
    Получает массив array и новый элемент i (i >= 0)
    Меняет в этом массиве i-й элемент местами с минимальным элементов в оставшейся части массива,
    начиная с i+1
    '''
    pass


def BubbleSortStep(array):
    '''
    Функция одного шага сортировки пузырьком.
    Получает массив целых чисел array
    и выполняет один пробег по массиву от начала к концу,
    меняя метами каждые два элемента i и i+1
    если i-й элемент больше i+1-го.
    Возвращает True, если по окончании пробега не было ни одного обмена элементов
    '''
    pass
